# Підключіть модель LLM за допомогою свого API key.
# Попросіть модель згенерувати:
# ● відповідь на питання у вигляді одного
# слова(наприклад яка столиця Франції?)
# ● код python
# ● коротку історію
# Підберіть параметри креативності та довжини

import os
import dotenv
from langchain_google_genai import GoogleGenerativeAI

dotenv.load_dotenv()

api_key = os.getenv("GEMINI_API_KEY")

llm = GoogleGenerativeAI(
    model="gemini-3.5-flash-lite",
    google_api_key=api_key,
    temperature=1.2,
    top_k = 10
)

# response = llm.invoke("Яка столиця Франції (одне слово)")
# response1 = llm.invoke("Напиши код python (3 речення)")
# response2 = llm.invoke("Напиши коротку історію (2 речення)")
# print(response)
# print(response1)
# print(response2)

# Прочитайте файл data\lesson9\rules.txt з правилами
# користування атракціону. Напишіть програму яка отримує
# від користувачі питання та дає відповідь на нього виходячи
# з текстового файлу.
# Для цього об’єднайте правила користування з питанням
# користувача.
# Користувач задає питання поки не введе порожній рядок.
# Змініть файл rules.txt, щоб переконатись що модель
# дійсно його читає.
# Прочитайте файл data\lesson9\rules.txt з правилами
# користування атракціону. Напишіть програму яка отримує
# від користувачі питання та дає відповідь на нього виходячи
# з текстового файлу.
# Для цього об’єднайте правила користування з питанням
# користувача.
# Користувач задає питання поки не введе порожній рядок.
# Змініть файл rules.txt, щоб переконатись що модель
# дійсно його читає.

with open("data/lesson9/rules.txt", encoding="utf-8") as file:
    rules = file.read()
#
# while True:
#     question = input("How can I help you: ")
#
#     if not question:
#         break
#
#     response = llm.generate([f"""
#     Ти консультант атракціону.
#
#     Ось правила користування атракціоном:
#     {rules}
#
#     Відповідай на питання клієнта тільки на основі цих правил.
#     Якщо відповіді на питання немає в правилах, відповідай:
#     "Я не знаю відповіді на це питання."
#
#     Відповідь має бути короткою — не більше 2 речень.
#
#     Питання користувача:
#     {question}
#     """])
#
#
#     print(f"Answer: {response}")

# Створіть найпростіший чат бот. Напишіть моделі якого
# персонажа вона повинна вдавати(відомий актор, персонаж
# кіно\книги, тощо).
# Реалізуйте двома способами:
# 1. Модель отримує інструкцію в якому стилі відповідати
# та нове повідомлення.
# 2. Модель отримує інструкцію та історію попередніх
# повідомлень як від користувача, так і її власні відповіді у
# форматі
# Instruction: ….
# Human: massage1
# AI: message2
# Human: massage3
# AI: message4
# Human: massage5
# AI:
instructions = """
     Ти консультант атракціону.

    Ось правила користування атракціоном:
    {rules}

    Відповідай на питання клієнта тільки на основі цих правил.
    Якщо відповіді на питання немає в правилах, відповідай:
    "Я не знаю відповіді на це питання."

    Відповідь має бути короткою — не більше 2 речень.

    Питання користувача:
    {question}"""

history = []
questions = []
responses = []

while True:
    question = input("How can I help you: ")

    if not question:
        break

    questions.append(question)

    history = ""

    for old_question, old_response in zip(history, question):
        history += f"\nUser: {old_question}"
        history += f"\nResponse: {old_response}"

    print(history)


